# üêº Pandas Practice: DataFrames, Selection, Mapping, and More

In [32]:
import pandas as pd
import numpy as np

# Set seed for reproducibility
np.random.seed(42)

# Sample data
names = ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona', 'George', 'Hannah']
departments = ['Sales', 'Marketing', 'HR', 'Tech']

# Create a DataFrame
df = pd.DataFrame({
    'Name': np.random.choice(names, size=20),
    'Age': np.random.randint(22, 60, size=20),
    'Department': np.random.choice(departments, size=20),
    'Salary': np.random.randint(40000, 120000, size=20),
    'YearsExperience': np.random.randint(0, 20, size=20)
})
df.head()

      Name  Age Department  Salary  YearsExperience
0   George   43         HR   75920               15
1    Diana   23  Marketing  107121               12
2    Ethan   45       Tech  109479               17
3   George   51      Sales   59457               14
4  Charlie   59       Tech  106557               12

# üß™ PRACTICE QUESTIONS BELOW


# 1Ô∏è‚É£ Use .loc to select all rows where the Department is 'Tech'.
#    - Describe what .loc does and why it's useful for label-based filtering.

In [23]:
tech_employees = df.loc[df['Department'] == 'Tech']
print(tech_employees)
#.loc is a label-based indexer in Pandas. It allows you to access specific rows and columns from a DataFrame using labels and supports powerful conditional filtering for data analysis.
#.loc is useful for Label-Based Filtering because it is intuitive and readable as you can filter data using meaningful labels like column names and values that makes your code easier to understand.
# and it has Flexible Filtering You can combine multiple conditions to accesss what you want

       Name  Age Department  Salary  YearsExperience
2     Ethan   45       Tech  109479               17
4   Charlie   59       Tech  106557               12
12  Charlie   49       Tech  111211               11
13  Charlie   37       Tech  105697                7
15    Ethan   24       Tech   72606               18
17   Hannah   28       Tech   80397                7
19  Charlie   30       Tech   95591                2


# 2Ô∏è‚É£ Use .iloc to select the first 5 rows and the last two columns.
#    - What is the difference between .loc and .iloc?

In [24]:
selected_data = df.iloc[:5, -2:]
print(selected_data)
#.loc and .iloc are both used for indexing and selecting data in Pandas DataFrames

# .loc uses label-based indexing you refer to rows and columns by their labels (names).
# .iloc uses integer-based indexing you refer to rows and columns by their integer position (index).

   Salary  YearsExperience
0   75920               15
1  107121               12
2  109479               17
3   59457               14
4  106557               12

bold text
# 3Ô∏è‚É£ Map a new column called 'DeptCode' where:
#     'Sales' -> 1, 'Marketing' -> 2, 'HR' -> 3, 'Tech' -> 4.
#    - Use .map and explain what happens if a value is not mapped.

In [25]:
dept_mapping = {
    'Sales': 1,
    'Marketing': 2,
    'HR': 3,
    'Tech': 4
}

df['DeptCode'] = df['Department'].map(dept_mapping)

print(df.head())
#.map() assigns NaN (a missing value) to that row in the 'DeptCode' column.

      Name  Age Department  Salary  YearsExperience  DeptCode
0   George   43         HR   75920               15         3
1    Diana   23  Marketing  107121               12         2
2    Ethan   45       Tech  109479               17         4
3   George   51      Sales   59457               14         1
4  Charlie   59       Tech  106557               12         4


# 4Ô∏è‚É£ Use .apply to calculate a new column 'Seniority' where:
#     - If YearsExperience > 10 ‚Üí 'Senior'
#     - If between 5-10 ‚Üí 'Mid-Level'
#     - Else ‚Üí 'Junior'
#    - Use a lambda function with apply.

In [26]:
df['Seniority'] = df['YearsExperience'].apply(
    lambda x: 'Senior' if x > 10 else ('Mid-Level' if x >= 5 else 'Junior')
)

print(df)

       Name  Age Department  Salary  YearsExperience  DeptCode  Seniority
0    George   43         HR   75920               15         3     Senior
1     Diana   23  Marketing  107121               12         2     Senior
2     Ethan   45       Tech  109479               17         4     Senior
3    George   51      Sales   59457               14         1     Senior
4   Charlie   59       Tech  106557               12         4     Senior
5    Hannah   23  Marketing  117189                8         2  Mid-Level
6     Ethan   42  Marketing  118953               14         2     Senior
7     Ethan   54  Marketing   92995               12         2     Senior
8    George   33      Sales   80757                0         1     Junior
9       Bob   43  Marketing   49692                6         2  Mid-Level
10  Charlie   46      Sales   85758                8         1  Mid-Level
11   George   48  Marketing  112409                0         2     Junior
12  Charlie   49       Tech  111211               11         4     Senior
13  Charlie   37       Tech  105697                7         4  Mid-Level
14   Hannah   36         HR   77065               10         3  Mid-Level
15    Ethan   24       Tech   72606               18         4     Senior
16    Diana   58         HR   51534               16         3     Senior
17   Hannah   28       Tech   80397                7         4  Mid-Level
18   Hannah   42      Sales   41016                2         1     Junior
19  Charlie   30       Tech   95591                2         4     Junior


# 5Ô∏è‚É£ Overwrite all salaries for employees with < 3 years of experience to 35000.
#    - Use boolean indexing with .loc to do this.

In [27]:
df.loc[df['YearsExperience'] < 3, 'Salary'] = 35000
print(df)

       Name  Age Department  Salary  YearsExperience  DeptCode  Seniority
0    George   43         HR   75920               15         3     Senior
1     Diana   23  Marketing  107121               12         2     Senior
2     Ethan   45       Tech  109479               17         4     Senior
3    George   51      Sales   59457               14         1     Senior
4   Charlie   59       Tech  106557               12         4     Senior
5    Hannah   23  Marketing  117189                8         2  Mid-Level
6     Ethan   42  Marketing  118953               14         2     Senior
7     Ethan   54  Marketing   92995               12         2     Senior
8    George   33      Sales   35000                0         1     Junior
9       Bob   43  Marketing   49692                6         2  Mid-Level
10  Charlie   46      Sales   85758                8         1  Mid-Level
11   George   48  Marketing   35000                0         2     Junior
12  Charlie   49       Tech  111211               11         4     Senior
13  Charlie   37       Tech  105697                7         4  Mid-Level
14   Hannah   36         HR   77065               10         3  Mid-Level
15    Ethan   24       Tech   72606               18         4     Senior
16    Diana   58         HR   51534               16         3     Senior
17   Hannah   28       Tech   80397                7         4  Mid-Level
18   Hannah   42      Sales   35000                2         1     Junior
19  Charlie   30       Tech   35000                2         4     Junior


# 6Ô∏è‚É£ Compare using .loc and .iloc to select the same row:
#    - Select the 3rd row using .iloc
#    - Find its index value and use .loc to select the same row by label

In [28]:
row_iloc = df.iloc[2]
print(row_iloc)
index_label = df.index[2]
row_loc = df.loc[index_label]
print(row_loc)

Name                Ethan
Age                    45
Department           Tech
Salary             109479
YearsExperience        17
DeptCode                4
Seniority          Senior
Name: 2, dtype: object
Name                Ethan
Age                    45
Department           Tech
Salary             109479
YearsExperience        17
DeptCode                4
Seniority          Senior
Name: 2, dtype: object


# 7Ô∏è‚É£ Check if there are any duplicate names in the dataset.
#    - If there are, show only those duplicated rows.

In [29]:
duplicate_names = df[df.duplicated('Name', keep=False)]
print(duplicate_names)

       Name  Age Department  Salary  YearsExperience  DeptCode  Seniority
0    George   43         HR   75920               15         3     Senior
1     Diana   23  Marketing  107121               12         2     Senior
2     Ethan   45       Tech  109479               17         4     Senior
3    George   51      Sales   59457               14         1     Senior
4   Charlie   59       Tech  106557               12         4     Senior
5    Hannah   23  Marketing  117189                8         2  Mid-Level
6     Ethan   42  Marketing  118953               14         2     Senior
7     Ethan   54  Marketing   92995               12         2     Senior
8    George   33      Sales   35000                0         1     Junior
10  Charlie   46      Sales   85758                8         1  Mid-Level
11   George   48  Marketing   35000                0         2     Junior
12  Charlie   49       Tech  111211               11         4     Senior
13  Charlie   37       Tech  105697                7         4  Mid-Level
14   Hannah   36         HR   77065               10         3  Mid-Level
15    Ethan   24       Tech   72606               18         4     Senior
16    Diana   58         HR   51534               16         3     Senior
17   Hannah   28       Tech   80397                7         4  Mid-Level
18   Hannah   42      Sales   35000                2         1     Junior
19  Charlie   30       Tech   35000                2         4     Junior


# 8Ô∏è‚É£ Sort the DataFrame by Salary in descending order.
#    - Then sort it by Department and within Department by Age.

In [33]:
sorted_by_salary = df.sort_values(by='Salary', ascending=False)
print("Sorted by Salary (Descending):")
print(sorted_by_salary)
sorted_by_dept_age = df.sort_values(by=['Department', 'Age'])
print("\nSorted by Department and Age:")
print(sorted_by_dept_age)

Sorted by Salary (Descending):
       Name  Age Department  Salary  YearsExperience
6     Ethan   42  Marketing  118953               14
5    Hannah   23  Marketing  117189                8
11   George   48  Marketing  112409                0
12  Charlie   49       Tech  111211               11
2     Ethan   45       Tech  109479               17
1     Diana   23  Marketing  107121               12
4   Charlie   59       Tech  106557               12
13  Charlie   37       Tech  105697                7
19  Charlie   30       Tech   95591                2
7     Ethan   54  Marketing   92995               12
10  Charlie   46      Sales   85758                8
8    George   33      Sales   80757                0
17   Hannah   28       Tech   80397                7
14   Hannah   36         HR   77065               10
0    George   43         HR   75920               15
15    Ethan   24       Tech   72606               18
3    George   51      Sales   59457               14
16    Diana   58         HR   51534               16
9       Bob   43  Marketing   49692                6
18   Hannah   42      Sales   41016                2

Sorted by Department and Age:
       Name  Age Department  Salary  YearsExperience
14   Hannah   36         HR   77065               10
0    George   43         HR   75920               15
16    Diana   58         HR   51534               16
1     Diana   23  Marketing  107121               12
5    Hannah   23  Marketing  117189                8
6     Ethan   42  Marketing  118953               14
9       Bob   43  Marketing   49692                6
11   George   48  Marketing  112409                0
7     Ethan   54  Marketing   92995               12
8    George   33      Sales   80757                0
18   Hannah   42      Sales   41016                2
10  Charlie   46      Sales   85758                8
3    George   51      Sales   59457               14
15    Ethan   24       Tech   72606               18
17   Hannah   28       Tech   80397                7
19  Charlie   30       Tech   95591                2
13  Charlie   37       Tech  105697                7
2     Ethan   45       Tech  109479               17
12  Charlie   49       Tech  111211               11
4   Charlie   59       Tech  106557               12


# 9Ô∏è‚É£ Slice the DataFrame to return rows 5 through 12 and columns 'Name', 'Salary'
#    - Try slicing using both label-based and position-based methods.

In [34]:
print(df.loc[5:12, ['Name', 'Salary']])
print(df.iloc[5:13, [0, 3]])

       Name  Salary
5    Hannah  117189
6     Ethan  118953
7     Ethan   92995
8    George   80757
9       Bob   49692
10  Charlie   85758
11   George  112409
12  Charlie  111211
       Name  Salary
5    Hannah  117189
6     Ethan  118953
7     Ethan   92995
8    George   80757
9       Bob   49692
10  Charlie   85758
11   George  112409
12  Charlie  111211


# üîü Find all rows where the name starts with 'A' or 'D'.
#    - Use string methods with .str accessor.

In [35]:
filtered_df = df[df['Name'].str.startswith(('A', 'D'))]

print(filtered_df)

     Name  Age Department  Salary  YearsExperience
1   Diana   23  Marketing  107121               12
16  Diana   58         HR   51534               16


# 1Ô∏è‚É£1Ô∏è‚É£ Drop all rows where Age is below 25.
#     - Explain whether this modifies the DataFrame in place or returns a copy.

In [36]:

df_filtered = df[df['Age'] >= 25]

print("DataFrame with Age >= 25:")
print(df_filtered)
#This returns a new copy of the DataFrame where all rows with Age < 25 are removed.

#The original df is not modified unless you explicitly reassign it

DataFrame with Age >= 25:
       Name  Age Department  Salary  YearsExperience
0    George   43         HR   75920               15
2     Ethan   45       Tech  109479               17
3    George   51      Sales   59457               14
4   Charlie   59       Tech  106557               12
6     Ethan   42  Marketing  118953               14
7     Ethan   54  Marketing   92995               12
8    George   33      Sales   80757                0
9       Bob   43  Marketing   49692                6
10  Charlie   46      Sales   85758                8
11   George   48  Marketing  112409                0
12  Charlie   49       Tech  111211               11
13  Charlie   37       Tech  105697                7
14   Hannah   36         HR   77065               10
16    Diana   58         HR   51534               16
17   Hannah   28       Tech   80397                7
18   Hannah   42      Sales   41016                2
19  Charlie   30       Tech   95591                2


# 1Ô∏è‚É£2Ô∏è‚É£ Use groupby to calculate the average salary per Department.
#     - Bonus: Show the average age and average experience too.

In [37]:
avg_salary_per_dept = df.groupby('Department')['Salary'].mean()

print("Average Salary per Department:")
print(avg_salary_per_dept)

Average Salary per Department:
Department
HR           68173.000000
Marketing    99726.500000
Sales        66747.000000
Tech         97362.571429
Name: Salary, dtype: float64


# 1Ô∏è‚É£3Ô∏è‚É£ Use groupby to count how many employees are in each Department.

In [39]:
employee_count = df.groupby('Department').size()

print("Number of employees per Department:")
print(employee_count)

Number of employees per Department:
Department
HR           3
Marketing    6
Sales        4
Tech         7
dtype: int64


# 1Ô∏è‚É£4Ô∏è‚É£ Use .apply to normalize the Salary column (min-max scaling between 0 and 1).
#     - Bonus: Write your own normalization function and pass it to apply.

In [38]:
df['NormalizedSalary'] = df['Salary'].apply(
    lambda x: (x - df['Salary'].min()) / (df['Salary'].max() - df['Salary'].min())
)
print(df[['Name', 'Salary', 'NormalizedSalary']])

       Name  Salary  NormalizedSalary
0    George   75920          0.447849
1     Diana  107121          0.848185
2     Ethan  109479          0.878440
3    George   59457          0.236614
4   Charlie  106557          0.840948
5    Hannah  117189          0.977366
6     Ethan  118953          1.000000
7     Ethan   92995          0.666936
8    George   80757          0.509912
9       Bob   49692          0.111321
10  Charlie   85758          0.574079
11   George  112409          0.916035
12  Charlie  111211          0.900663
13  Charlie  105697          0.829914
14   Hannah   77065          0.462540
15    Ethan   72606          0.405327
16    Diana   51534          0.134955
17   Hannah   80397          0.505293
18   Hannah   41016          0.000000
19  Charlie   95591          0.700245


# 1Ô∏è‚É£5Ô∏è‚É£ Use boolean indexing to find all employees who:
#     - Are in 'HR' OR 'Tech', AND have > 5 years of experience.

# üîÅ For many of these tasks, try both .loc and .iloc to build intuition on their differences.

In [41]:
filtered_df = df[
    ((df['Department'] == 'HR') | (df['Department'] == 'Tech')) &
    (df['YearsExperience'] > 5)
]
print(filtered_df)

       Name  Age Department  Salary  YearsExperience  NormalizedSalary
0    George   43         HR   75920               15          0.447849
2     Ethan   45       Tech  109479               17          0.878440
4   Charlie   59       Tech  106557               12          0.840948
12  Charlie   49       Tech  111211               11          0.900663
13  Charlie   37       Tech  105697                7          0.829914
14   Hannah   36         HR   77065               10          0.462540
15    Ethan   24       Tech   72606               18          0.405327
16    Diana   58         HR   51534               16          0.134955
17   Hannah   28       Tech   80397                7          0.505293